import {T_Topic} from "src/modules/types.ts";

export const TopicMocks:T_Topic[] = [
    {
        topic_id: 1,
        name: "Искусство и Культура",
        description: "Категория включает в себя выставки, посвящённые живописи, скульптуре, архитектуре, литературе, театру, кино и музыке. Это могут быть как исторические экспозиции, так и современные художественные проекты.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im1.png"
      },
      {
        topic_id: 2,
        name: "Наука и Технологии",
        description: "Здесь размещаются выставки, посвящённые научным открытиям, изобретениям, развитию технологий, а также инновациям будущего. Темы могут охватывать разные области науки — физику, биологию, космологию, информатику и другие.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im2.png"
      },
      {
        topic_id: 3,
        name: "История и Наследие",
        description: "Категория для выставок, посвящённых историческим событиям, культурному наследию, важным периодам в истории человечества и древним цивилизациям. Это могут быть экспозиции о ключевых фигурах, эпохах и мировом наследии.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im3.png"
      },
      {
        topic_id: 4,
        name: "Природа и Экология",
        description: "Выставки в этой категории сосредоточены на окружающей среде, экосистемах, изменении климата и природоохранных инициативах. Здесь можно изучать природные явления, флору и фауну, а также экологические проблемы и их решения.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im4.png"
      },
      {
        topic_id: 6,
        name: "Музыка и Звук",
        description: "Экспозиции, посвящённые истории музыки, музыкальным жанрам, известным композиторам и исполнителям. Включает как классическую, так и современную музыку, а также изучение звуковой культуры.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im6.png"
      },
      {
        topic_id: 7,
        name: "Человеческое тело",
        description: "Научная выставка, исследующая историю и искусство анатомии и медицины. Экспонаты включают изображения человеческого тела, созданные для научных исследований, а также информацию о развитии медицинских технологий и научных открытий, которые повлияли на здравоохранение.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im7.png"
      },
      {
        topic_id: 8,
        name: "Спорт и Здоровье",
        description: "Категория для выставок, связанных с историей спорта, олимпийским движением, физическим здоровьем, фитнесом и медициной. Здесь могут быть представлены как спортивные достижения, так и темы, связанные с медицинскими инновациями.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im8.png"
      },
      {
        topic_id: 5,
        name: "Цифровые искусства",
        description: "Выставки, которые исследуют влияние цифровых технологий на искусство, включая мультимедийные инсталляции, видеоарт, 3D-графику и искусственный интеллект в креативной индустрии. Это пространство для современных цифровых проектов.",
        photo_url: "https://http://localhost:9001/images/http%3A/127.0.0.1%3A9000/images/im5.png"
      }
]